Repository: fangjunyu1/SwiftSlim
Catalog: SwiftSlim/Localization/Localizable.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, fi, fr, gu, he, hi, hr, hu, id, it, ja, kk, kn, ko, lt, ml, mr, ms, nb, nl, or, pa, pl, pt, ro, ru, sk, sl, sv, ta, te, th, tr, uk, ur, vi, zh_hans, zh_hant

# why_this_app1
source: I built this app because I went through the process of starting with weak foundations and gradually learning development myself, so I understand more clearly the difficulties beginners face when getting started.
ar: طوّرت هذا التطبيق لأنني مررت بنفسي بتجربة البدء من أساس ضعيف ثم التعلّم التدريجي للتطوير، لذلك أفهم بشكل أوضح الصعوبات التي يواجهها المبتدئون عند البداية.
bg: Създадох това приложение, защото самият аз преминах през процеса на това да започна със слаба основа и постепенно да се уча на разработка, затова разбирам по-добре трудностите, с които начинаещите се сблъскват в началото.
bn: আমি এই অ্যাপটি তৈরি করেছি কারণ আমি নিজেও দুর্বল ভিত্তি থেকে ধীরে ধীরে ডেভেলপমেন্ট শেখার প্রক্রিয়ার মধ্য দিয়ে গেছি, তাই নতুনরা শুরুতে যে সমস্যাগুলোর মুখোমুখি হয়, সেগুলো আমি আরও ভালোভাবে বুঝি।
ca: Vaig crear aquesta app perquè jo mateix vaig passar pel procés de començar amb una base feble i anar aprenent desenvolupament a poc a poc, així que entenc millor les dificultats que tenen els principiants quan comencen.
cs: Vytvořil jsem tuto aplikaci, protože jsem sám prošel procesem od slabých základů k postupnému učení vývoje, a proto lépe rozumím obtížím, se kterými se začátečníci setkávají při začátcích.
da: Jeg lavede denne app, fordi jeg selv har været igennem processen fra et svagt grundlag til gradvist at lære udvikling, så jeg forstår tydeligere de vanskeligheder, begyndere møder, når de starter.
de: Ich habe diese App entwickelt, weil ich selbst den Weg von schwachen Grundlagen hin zum schrittweisen Lernen der Entwicklung durchlaufen habe und daher die Schwierigkeiten von Einsteigern beim Einstieg besser verstehe.
el: Δημιούργησα αυτή την εφαρμογή επειδή πέρασα κι εγώ ο ίδιος από τη διαδικασία του να ξεκινήσω με αδύναμες βάσεις και να μαθαίνω σταδιακά την ανάπτυξη, γι’ αυτό κατανοώ πιο καθαρά τις δυσκολίες που αντιμετωπίζουν οι αρχάριοι όταν ξεκινούν.
es: Creé esta app porque yo mismo pasé por el proceso de partir de una base débil e ir aprendiendo desarrollo poco a poco, así que entiendo mejor las dificultades que enfrentan los principiantes cuando empiezan.
fi: Tein tämän sovelluksen, koska kävin itse läpi prosessin, jossa lähdin liikkeelle heikoista perusteista ja opettelin kehitystyötä vähitellen, joten ymmärrän selkeämmin ne vaikeudet, joita aloittelijat kohtaavat alussa.
fr: J’ai créé cette app parce que j’ai moi-même traversé un parcours allant de bases fragiles à un apprentissage progressif du développement, ce qui me permet de mieux comprendre les difficultés que rencontrent les débutants au départ.
gu: મેં આ એપ બનાવી છે કારણ કે હું પોતે નબળી પાયાથી શરૂઆત કરીને ધીમે ધીમે ડેવલપમેન્ટ શીખવાની પ્રક્રિયામાંથી પસાર થયો છું, તેથી શરૂઆત વખતે નવા શીખનારાઓને આવતી મુશ્કેલીઓ હું વધુ સારી રીતે સમજું છું.
he: יצרתי את האפליקציה הזו כי גם אני עברתי תהליך של התחלה מבסיס חלש ולמידה הדרגתית של פיתוח, ולכן אני מבין טוב יותר את הקשיים שמתחילים חווים בתחילת הדרך.
hi: मैंने यह ऐप इसलिए बनाया क्योंकि मैं खुद भी कमजोर आधार से धीरे-धीरे डेवलपमेंट सीखने की प्रक्रिया से गुज़रा हूँ, इसलिए मैं बेहतर समझता हूँ कि शुरुआत में नए सीखने वालों को किन कठिनाइयों का सामना करना पड़ता है।
hr: Napravio sam ovu aplikaciju zato što sam i sam prošao put od slabih osnova do postupnog učenja razvoja, pa zato jasnije razumijem poteškoće s kojima se početnici susreću na početku.
hu: Azért készítettem ezt az appot, mert én magam is végigmentem azon a folyamaton, hogy gyenge alapokról indulva fokozatosan tanultam meg a fejlesztést, ezért jobban értem, milyen nehézségekkel találkoznak a kezdők induláskor.
id: Saya membuat aplikasi ini karena saya sendiri pernah melalui proses dari dasar yang lemah hingga belajar pengembangan secara bertahap, sehingga saya lebih memahami kesulitan yang dihadapi pemula saat baru memulai.
it: Ho creato questa app perché anch’io ho vissuto il percorso che va da basi deboli all’apprendimento graduale dello sviluppo, e per questo capisco meglio le difficoltà che i principianti incontrano quando iniziano.
ja: このアプリを作ったのは、私自身が基礎の弱い状態から少しずつ開発を学んできた経験があり、初学者が入門時に感じる戸惑いや難しさをよりよく理解しているからです。
kk: Мен бұл қолданбаны жасаған себебім — өзім де әлсіз негізден бастап, әзірлеуді біртіндеп үйрену жолынан өттім, сондықтан жаңадан бастаушылардың алғашқы кезеңде кездесетін қиындықтарын жақсырақ түсінемін.
kn: ನಾನು ಈ ಆಪ್ ಅನ್ನು ನಿರ್ಮಿಸಿದ್ದೇನೆ, ಏಕೆಂದರೆ ನಾನು ಸ್ವತಃ ದುರ್ಬಲವಾದ ನೆಲೆಯಿಂದ ಆರಂಭಿಸಿ ಹಂತ ಹಂತವಾಗಿ ಡೆವಲಪ್ಮೆಂಟ್‌ ಕಲಿತ ಅನುಭವ ಹೊಂದಿದ್ದೇನೆ; ಆದ್ದರಿಂದ ಪ್ರಾರಂಭಿಸುವಾಗ ಆರಂಭಿಕರು ಎದುರಿಸುವ ಗೊಂದಲಗಳನ್ನು ನಾನು ಇನ್ನಷ್ಟು ಸ್ಪಷ್ಟವಾಗಿ ಅರ್ಥಮಾಡಿಕೊಳ್ಳುತ್ತೇನೆ.
ko: 이 앱을 만든 이유는 저 역시 기초가 약한 상태에서 조금씩 개발을 배워 온 과정을 직접 겪었기 때문에, 초보자가 입문할 때 느끼는 어려움과 혼란을 더 잘 이해하고 있기 때문입니다.
lt: Sukūriau šią programėlę todėl, kad pats praėjau kelią nuo silpnų pagrindų iki laipsniško mokymosi kurti, todėl aiškiau suprantu sunkumus, su kuriais pradedantieji susiduria pradėdami.
ml: ഞാൻ തന്നെയും ദുർബലമായ അടിസ്ഥാനത്തിൽ നിന്ന് ആരംഭിച്ച് ക്രമേണ ഡെവലപ്‌മെന്റ് പഠിച്ചുപോയ അനുഭവം ഉണ്ടായതിനാലാണ് ഈ ആപ്പ് ഞാൻ നിർമ്മിച്ചത്; അതുകൊണ്ട് തുടക്കക്കാരൻമാർ ആരംഭത്തിൽ നേരിടുന്ന ബുദ്ധിമുട്ടുകൾ ഞാൻ കൂടുതൽ വ്യക്തമായി മനസ്സിലാക്കുന്നു.
mr: मी हे अॅप तयार केले कारण मी स्वतःही कमकुवत पायाभूत तयारीपासून हळूहळू डेव्हलपमेंट शिकण्याचा प्रवास अनुभवला आहे, त्यामुळे सुरुवातीला नवशिक्यांना येणाऱ्या अडचणी मी अधिक चांगल्या प्रकारे समजू शकतो.
ms: Saya membina aplikasi ini kerana saya sendiri pernah melalui proses bermula dengan asas yang lemah dan belajar pembangunan secara beransur-ansur, jadi saya lebih memahami kesukaran yang dihadapi oleh pemula ketika baru bermula.
nb: Jeg laget denne appen fordi jeg selv har vært gjennom prosessen med å starte med et svakt grunnlag og gradvis lære utvikling, så jeg forstår tydeligere hvilke vanskeligheter nybegynnere møter når de kommer i gang.
nl: Ik heb deze app gemaakt omdat ik zelf het proces heb doorgemaakt van een zwakke basis naar het geleidelijk leren van ontwikkelen, waardoor ik beter begrijp met welke moeilijkheden beginners te maken krijgen wanneer ze beginnen.
or: ମୁଁ ଏହି ଆପ୍‌ଟି ତିଆରି କରିଛି କାରଣ ମୁଁ ନିଜେ ଦୁର୍ବଳ ଭିତ୍ତିରୁ ଆରମ୍ଭ କରି ଧୀରେ ଧୀରେ ଡେଭେଲପମେଣ୍ଟ ଶିଖିବା ପ୍ରକ୍ରିୟା ମଧ୍ୟରୁ ଯାଇଛି, ତେଣୁ ଆରମ୍ଭ ସମୟରେ ନବଶିକ୍ଷୁମାନେ ଯେଉଁ ଅସୁବିଧାର ସମ୍ମୁଖୀନ ହୁଅନ୍ତି, ସେଗୁଡ଼ିକୁ ମୁଁ ଅଧିକ ସ୍ପଷ୍ଟଭାବେ ବୁଝିପାରେ।
pa: ਮੈਂ ਇਹ ਐਪ ਇਸ ਲਈ ਬਣਾਈ ਕਿਉਂਕਿ ਮੈਂ ਖੁਦ ਕਮਜ਼ੋਰ ਬੁਨਿਆਦ ਤੋਂ ਹੌਲੀ-ਹੌਲੀ ਡਿਵੈਲਪਮੈਂਟ ਸਿੱਖਣ ਵਾਲੇ ਇਸ ਸਫ਼ਰ ਵਿਚੋਂ ਲੰਘਿਆ ਹਾਂ, ਇਸ ਲਈ ਮੈਂ ਹੋਰ ਵਧੀਆ ਤਰੀਕੇ ਨਾਲ ਸਮਝਦਾ ਹਾਂ ਕਿ ਸ਼ੁਰੂਆਤ ਵੇਲੇ ਨਵੇਂ ਸਿੱਖਣ ਵਾਲਿਆਂ ਨੂੰ ਕਿਹੜੀਆਂ ਮੁਸ਼ਕਲਾਂ ਆਉਂਦੀਆਂ ਹਨ।
pl: Stworzyłem tę aplikację, ponieważ sam przeszedłem drogę od słabych podstaw do stopniowej nauki tworzenia, dlatego lepiej rozumiem trudności, z jakimi początkujący mierzą się na starcie.
pt: Criei este app porque eu mesmo passei pelo processo de sair de uma base fraca e aprender desenvolvimento gradualmente, por isso entendo com mais clareza as dificuldades que os iniciantes enfrentam no começo.
ro: Am creat această aplicație pentru că și eu am trecut prin procesul de a porni cu o bază slabă și de a învăța treptat dezvoltarea, așa că înțeleg mai clar dificultățile cu care se confruntă începătorii la început.
ru: Я создал это приложение, потому что сам прошёл путь от слабой базы к постепенному изучению разработки, и поэтому лучше понимаю трудности, с которыми сталкиваются начинающие на старте.
sk: Túto aplikáciu som vytvoril preto, že som sám prešiel cestou od slabých základov k postupnému učeniu sa vývoja, a preto lepšie rozumiem ťažkostiam, s ktorými sa začiatočníci stretávajú na začiatku.
sl: To aplikacijo sem ustvaril zato, ker sem tudi sam šel skozi proces od šibkih osnov do postopnega učenja razvoja, zato bolje razumem težave, s katerimi se začetniki srečujejo na začetku.
sv: Jag skapade den här appen eftersom jag själv har gått igenom processen att börja med svaga grunder och gradvis lära mig utveckling, så jag förstår tydligare de svårigheter som nybörjare möter i början.
ta: இந்த செயலியை நான் உருவாக்கியது, நானும் பலவீனமான அடிப்படையில் இருந்து படிப்படியாக டெவலப்மென்ட் கற்றுக்கொண்ட அனுபவத்தை கடந்திருக்கிறேன் என்பதால்தான்; அதனால் தொடக்கநிலையிலுள்ளவர்களுக்கு ஆரம்பத்தில் ஏற்படும் சிரமங்களை நான் மேலும் தெளிவாகப் புரிந்துகொள்கிறேன்.
te: నేను ఈ యాప్‌ను రూపొందించిన కారణం, నేనూ బలహీనమైన పునాదితో మొదలుకొని క్రమంగా డెవలప్‌మెంట్ నేర్చుకున్న అనుభవం కలిగి ఉండటమే; అందుకే ప్రారంభ దశలో మొదటిసారిగా నేర్చుకునేవారు ఎదుర్కొనే కష్టాలను నేను మరింత స్పష్టంగా అర్థం చేసుకుంటాను.
th: ผมสร้างแอปนี้ขึ้นมา เพราะตัวผมเองก็เคยผ่านช่วงที่มีพื้นฐานอ่อนและค่อย ๆ เรียนรู้การพัฒนามาทีละขั้นเช่นกัน จึงเข้าใจได้ชัดเจนยิ่งขึ้นว่าผู้เริ่มต้นมักสับสนและเจอความยากลำบากอะไรบ้างในช่วงเริ่มต้น
tr: Bu uygulamayı geliştirdim çünkü ben de zayıf bir temelden başlayıp geliştirmeyi adım adım öğrenme sürecinden geçtim; bu yüzden yeni başlayanların ilk adımda yaşadığı zorlukları daha iyi anlıyorum.
uk: Я створив цей застосунок, тому що сам пройшов шлях від слабкої бази до поступового вивчення розробки, тож краще розумію труднощі, з якими стикаються початківці на старті.
ur: میں نے یہ ایپ اس لیے بنائی کیونکہ میں خود بھی کمزور بنیاد سے آغاز کرکے آہستہ آہستہ ڈویلپمنٹ سیکھنے کے اس مرحلے سے گزرا ہوں، اس لیے میں بہتر طور پر سمجھتا ہوں کہ ابتدائی سیکھنے والوں کو شروع میں کن مشکلات کا سامنا ہوتا ہے۔
vi: Tôi tạo ra ứng dụng này vì chính tôi cũng đã trải qua quá trình đi từ nền tảng còn yếu đến từng bước học phát triển, nên tôi hiểu rõ hơn những khó khăn mà người mới thường gặp phải khi bắt đầu.
zh_hans: 开发这款 App，是因为我自己经历过从基础薄弱到逐步学习开发的过程，所以更清楚初学者在入门时的困惑。
zh_hant: 開發這款 App，是因為我自己經歷過從基礎薄弱到逐步學習開發的過程，所以更清楚初學者在入門時的困惑。

# why_this_app2
source: Many people find programming difficult not necessarily because programming languages themselves are complex, but because they are exposed to too many abstract concepts right from the beginning and lack a gradual, step-by-step learning process.
ar: يرى كثير من الناس أن البرمجة صعبة، وليس بالضرورة لأن لغات البرمجة نفسها معقدة، بل لأنهم يواجهون منذ البداية عددًا كبيرًا من المفاهيم المجردة ويفتقرون إلى عملية تعلم تدريجية خطوة بخطوة.
bg: Много хора смятат програмирането за трудно не непременно защото самите програмни езици са сложни, а защото още в началото се сблъскват с твърде много абстрактни понятия и им липсва постепенно, поетапно обучение.
bn: অনেকেই মনে করেন প্রোগ্রামিং কঠিন, কিন্তু তার কারণ সবসময় প্রোগ্রামিং ভাষা নিজেই জটিল হওয়া নয়; বরং শুরুতেই খুব বেশি বিমূর্ত ধারণার মুখোমুখি হতে হয় এবং ধাপে ধাপে শেখার একটি প্রক্রিয়া থাকে না।
ca: Moltes persones troben difícil la programació no necessàriament perquè els llenguatges de programació siguin complexos, sinó perquè des del principi es troben amb massa conceptes abstractes i no tenen un procés d’aprenentatge gradual i pas a pas.
cs: Mnoho lidí považuje programování za obtížné ne nutně proto, že jsou samotné programovací jazyky složité, ale protože se hned na začátku setkají s příliš mnoha abstraktními pojmy a chybí jim postupný proces učení krok za krokem.
da: Mange synes, at programmering er svært, ikke nødvendigvis fordi programmeringssprog i sig selv er komplekse, men fordi de fra begyndelsen møder for mange abstrakte begreber og mangler en gradvis læringsproces trin for trin.
de: Viele Menschen empfinden Programmieren als schwierig, nicht unbedingt weil Programmiersprachen an sich komplex sind, sondern weil sie von Anfang an mit zu vielen abstrakten Konzepten konfrontiert werden und ein schrittweiser Lernprozess fehlt.
el: Πολλοί άνθρωποι θεωρούν τον προγραμματισμό δύσκολο όχι απαραίτητα επειδή οι ίδιες οι γλώσσες προγραμματισμού είναι πολύπλοκες, αλλά επειδή από την αρχή έρχονται σε επαφή με πάρα πολλές αφηρημένες έννοιες και τους λείπει μια σταδιακή, βήμα προς βήμα διαδικασία μάθησης.
es: Muchas personas sienten que programar es difícil, no necesariamente porque los lenguajes de programación sean complejos en sí mismos, sino porque desde el principio se encuentran con demasiados conceptos abstractos y les falta un proceso de aprendizaje gradual.
fi: Monet pitävät ohjelmointia vaikeana, eikä se välttämättä johdu siitä, että ohjelmointikielet itsessään olisivat monimutkaisia, vaan siitä, että heti alussa kohdataan liian paljon abstrakteja käsitteitä ilman asteittain etenevää oppimisprosessia.
fr: Beaucoup de personnes trouvent la programmation difficile, non pas forcément parce que les langages de programmation sont eux-mêmes complexes, mais parce qu’elles sont confrontées dès le départ à trop de concepts abstraits, sans parcours d’apprentissage progressif.
gu: ઘણા લોકોને પ્રોગ્રામિંગ મુશ્કેલ લાગે છે, તે જરૂરી નથી કે પ્રોગ્રામિંગ ભાષાઓ પોતે જ બહુ જટિલ હોય, પરંતુ કારણ એ છે કે શરૂઆતથી જ તેમને બહુ બધા અભિધાનાત્મક ખ્યાલોનો સામનો કરવો પડે છે અને પગલુંદર પગલું શીખવાની પ્રક્રિયા મળતી નથી.
he: הרבה אנשים חושבים שתכנות הוא קשה, לאו דווקא משום ששפות התכנות עצמן מורכבות, אלא משום שכבר בתחילת הדרך הם נחשפים ליותר מדי מושגים מופשטים וחסר להם תהליך למידה הדרגתי, שלב אחר שלב.
hi: कई लोगों को प्रोग्रामिंग कठिन लगती है, लेकिन इसका कारण हमेशा यह नहीं होता कि प्रोग्रामिंग भाषाएँ खुद जटिल हैं, बल्कि यह होता है कि शुरुआत में ही बहुत ज़्यादा अमूर्त अवधारणाओं का सामना करना पड़ता है और सीखने की क्रमिक, चरण-दर-चरण प्रक्रिया नहीं मिलती।
hr: Mnogi ljudi smatraju programiranje teškim ne nužno zato što su sami programski jezici složeni, nego zato što se od samog početka susreću s previše apstraktnih pojmova i nedostaje im postupan, korak-po-korak proces učenja.
hu: Sokan azért érzik nehéznek a programozást, nem feltétlenül azért, mert maguk a programozási nyelvek bonyolultak, hanem mert már a kezdetektől túl sok elvont fogalommal találkoznak, és hiányzik egy fokozatos, lépésről lépésre felépített tanulási folyamat.
id: Banyak orang merasa pemrograman itu sulit, bukan semata-mata karena bahasa pemrograman itu sendiri rumit, melainkan karena sejak awal mereka sudah berhadapan dengan terlalu banyak konsep abstrak dan tidak memiliki proses belajar yang bertahap.
it: Molte persone trovano difficile la programmazione non necessariamente perché i linguaggi di programmazione siano di per sé complessi, ma perché fin dall’inizio si trovano di fronte a troppi concetti astratti e manca un percorso di apprendimento graduale.
ja: 多くの人がプログラミングを難しいと感じるのは、必ずしもプログラミング言語そのものが複雑だからではなく、最初から抽象的な概念に多く触れすぎてしまい、段階的に学べる過程が不足しているからです。
kk: Көптеген адамдар бағдарламалауды қиын деп санайды, бұл міндетті түрде бағдарламалау тілдерінің өздері күрделі болғандықтан емес, керісінше ең басында тым көп абстрактілі ұғымдарға тап болып, біртіндеп үйрететін оқу үдерісінің болмауынан.
kn: ಅನೇಕರು ಪ್ರೋಗ್ರಾಮಿಂಗ್ ಕಷ್ಟವೆಂದು ಭಾವಿಸುತ್ತಾರೆ; ಅದು ಯಾವಾಗಲೂ ಪ್ರೋಗ್ರಾಮಿಂಗ್ ಭಾಷೆಗಳು ಸ್ವತಃ ಸಂಕೀರ್ಣವಾಗಿರುವುದರಿಂದ ಅಲ್ಲ, ಆರಂಭದಲ್ಲೇ ತುಂಬಾ ಹೆಚ್ಚು ಅಮೂರ್ತ ಕಲ್ಪನೆಗಳನ್ನು ಎದುರಿಸಬೇಕಾಗುವುದರಿಂದ ಮತ್ತು ಹಂತ ಹಂತವಾಗಿ ಕಲಿಯುವ ಪ್ರಕ್ರಿಯೆ ಕೊರತೆಯಾಗುವುದರಿಂದ.
ko: 많은 사람들이 프로그래밍을 어렵게 느끼는 것은 반드시 프로그래밍 언어 자체가 복잡해서라기보다는, 처음부터 너무 많은 추상 개념을 접하게 되고 단계적으로 배워 나가는 과정이 부족하기 때문입니다.
lt: Daugeliui žmonių programavimas atrodo sunkus nebūtinai todėl, kad pačios programavimo kalbos yra sudėtingos, o todėl, kad nuo pat pradžių tenka susidurti su per daug abstrakčių sąvokų ir trūksta nuoseklaus, laipsniško mokymosi proceso.
ml: പ്രോഗ്രാമിംഗ് ബുദ്ധിമുട്ടാണെന്ന് പലർക്കും തോന്നുന്നു; അതിന് കാരണം പ്രോഗ്രാമിംഗ് ഭാഷകൾ സ്വതവേ വളരെ സങ്കീർണ്ണമാണെന്നല്ല, മറിച്ച് തുടക്കത്തിൽ തന്നെ അത്യധികം സങ്കൽപ്പാത്മകമായ ആശയങ്ങളുമായി സമ്പർക്കത്തിലാകുകയും ഘട്ടംഘട്ടമായ പഠന പ്രക്രിയ ഇല്ലാതിരിക്കുകയും ചെയ്യുന്നതാണ്.
mr: अनेकांना प्रोग्रामिंग कठीण वाटते, पण त्याचे कारण नेहमीच प्रोग्रामिंग भाषा स्वतः गुंतागुंतीच्या आहेत असे नसते; तर सुरुवातीपासूनच खूप अमूर्त संकल्पनांचा सामना करावा लागतो आणि टप्प्याटप्प्याने शिकण्याची प्रक्रिया नसते.
ms: Ramai orang merasakan pengaturcaraan itu sukar, bukan semestinya kerana bahasa pengaturcaraan itu sendiri rumit, tetapi kerana sejak awal lagi mereka terdedah kepada terlalu banyak konsep abstrak dan tidak mempunyai proses pembelajaran yang berperingkat.
nb: Mange synes at programmering er vanskelig, ikke nødvendigvis fordi programmeringsspråk i seg selv er komplekse, men fordi de helt fra starten blir eksponert for for mange abstrakte begreper og mangler en gradvis læringsprosess steg for steg.
nl: Veel mensen vinden programmeren moeilijk, niet per se omdat programmeertalen zelf ingewikkeld zijn, maar omdat ze vanaf het begin met te veel abstracte concepten worden geconfronteerd en een geleidelijk, stapsgewijs leerproces missen.
or: ଅନେକ ଲୋକଙ୍କୁ ପ୍ରୋଗ୍ରାମିଂ କଠିନ ଲାଗେ, ଏହାର କାରଣ ସବୁବେଳେ ପ୍ରୋଗ୍ରାମିଂ ଭାଷା ନିଜେ ଜଟିଳ ଥିବା ନୁହେଁ; ବରଂ ଆରମ୍ଭରୁ ହିଁ ବହୁତ ଅଧିକ ଅବ୍ୟବହାରିକ ଧାରଣା ସହିତ ପରିଚୟ ହୁଏ ଏବଂ ପଦେ ପଦେ ଶିଖିବା ପ୍ରକ୍ରିୟାର ଅଭାବ ଥାଏ।
pa: ਬਹੁਤ ਸਾਰੇ ਲੋਕਾਂ ਨੂੰ ਪ੍ਰੋਗ੍ਰਾਮਿੰਗ ਮੁਸ਼ਕਲ ਲੱਗਦੀ ਹੈ, ਇਹ ਲਾਜ਼ਮੀ ਨਹੀਂ ਕਿ ਪ੍ਰੋਗ੍ਰਾਮਿੰਗ ਭਾਸ਼ਾਵਾਂ ਆਪ ਵਿੱਚ ਹੀ ਬਹੁਤ ਜਟਿਲ ਹਨ; ਸਗੋਂ ਇਸ ਲਈ ਕਿ ਸ਼ੁਰੂ ਤੋਂ ਹੀ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਅਮੂਰਤ ਖ਼ਿਆਲਾਂ ਨਾਲ ਪਾਲਾ ਪੈਂਦਾ ਹੈ ਅਤੇ ਕਦਮ-ਦਰ-ਕਦਮ ਸਿੱਖਣ ਦੀ ਪ੍ਰਕਿਰਿਆ ਨਹੀਂ ਮਿਲਦੀ।
pl: Wiele osób uważa programowanie za trudne niekoniecznie dlatego, że same języki programowania są skomplikowane, lecz dlatego, że już na początku spotykają się ze zbyt wieloma abstrakcyjnymi pojęciami i brakuje im stopniowego procesu nauki krok po kroku.
pt: Muitas pessoas acham programação difícil, não necessariamente porque as linguagens de programação sejam complexas por si só, mas porque logo no começo entram em contato com conceitos abstratos demais e não têm um processo de aprendizagem gradual.
ro: Mulți oameni consideră programarea dificilă, nu neapărat pentru că limbajele de programare în sine sunt complexe, ci pentru că încă de la început intră în contact cu prea multe concepte abstracte și le lipsește un proces de învățare gradual, pas cu pas.
ru: Многим людям программирование кажется сложным не обязательно потому, что сами языки программирования сложны, а потому, что с самого начала они сталкиваются со слишком большим количеством абстрактных понятий и им не хватает постепенного, пошагового процесса обучения.
sk: Mnohí ľudia považujú programovanie za ťažké nie nevyhnutne preto, že samotné programovacie jazyky sú zložité, ale preto, že sa hneď na začiatku stretnú s príliš veľkým množstvom abstraktných pojmov a chýba im postupný proces učenia krok za krokom.
sl: Veliko ljudi meni, da je programiranje težko, ne nujno zato, ker bi bili programski jeziki sami po sebi zapleteni, temveč zato, ker se že na začetku srečajo s preveč abstraktnimi pojmi in jim manjka postopen proces učenja korak za korakom.
sv: Många tycker att programmering är svårt, inte nödvändigtvis för att programmeringsspråken i sig är komplexa, utan för att man redan från början möter alltför många abstrakta begrepp och saknar en gradvis inlärningsprocess steg för steg.
ta: பலர் நிரலாக்கம் கடினம் என்று நினைப்பது, நிரலாக்க மொழிகள் தாமாகவே மிகவும் சிக்கலானவை என்பதாலல்ல; தொடக்கத்திலேயே மிக அதிகமான கருத்தியல் மற்றும் அமூர்த்தமான கருத்துகளைச் சந்திக்க வேண்டியிருப்பதாலும், படிப்படியாக கற்றுக்கொள்ளும் செயல்முறை இல்லாததாலுமே ஆகும்.
te: చాలామందికి ప్రోగ్రామింగ్ కష్టం అనిపిస్తుంది; దానికి కారణం ఎప్పుడూ ప్రోగ్రామింగ్ భాషలే స్వతహాగా క్లిష్టంగా ఉండటం కాదు, ప్రారంభం నుంచే చాలా ఎక్కువ సారాంశాత్మక భావనలు ఎదురవడం మరియు దశలవారీగా నేర్చుకునే ప్రక్రియ లేకపోవడమే.
th: หลายคนรู้สึกว่าการเขียนโปรแกรมเป็นเรื่องยาก ไม่ได้หมายความว่าเป็นเพราะภาษาการเขียนโปรแกรมนั้นซับซ้อนเสมอไป แต่เป็นเพราะตั้งแต่เริ่มต้นก็ต้องเจอกับแนวคิดเชิงนามธรรมมากเกินไป และขาดกระบวนการเรียนรู้แบบค่อยเป็นค่อยไป
tr: Birçok insan programlamayı zor bulur; bunun nedeni her zaman programlama dillerinin kendi başına karmaşık olması değildir, asıl neden daha en başta çok fazla soyut kavramla karşılaşmaları ve adım adım ilerleyen bir öğrenme sürecinin eksik olmasıdır.
uk: Багатьом людям програмування здається складним не обов’язково тому, що самі мови програмування є складними, а тому, що від самого початку вони стикаються з надто великою кількістю абстрактних понять і не мають поступового, покрокового процесу навчання.
ur: بہت سے لوگوں کو پروگرامنگ مشکل لگتی ہے، یہ ضروری نہیں کہ اس کی وجہ خود پروگرامنگ زبانوں کا پیچیدہ ہونا ہو، بلکہ اس لیے کہ ابتدا ہی میں انہیں بہت زیادہ تجریدی تصورات کا سامنا کرنا پڑتا ہے اور مرحلہ وار سیکھنے کا عمل موجود نہیں ہوتا۔
vi: Nhiều người cảm thấy lập trình khó, không hẳn vì bản thân ngôn ngữ lập trình quá phức tạp, mà vì ngay từ đầu họ đã phải tiếp xúc với quá nhiều khái niệm trừu tượng và thiếu một quá trình học tập từng bước, dần dần.
zh_hans: 很多人觉得编程难，并不一定是因为编程语言本身复杂，而是因为一开始就接触了太多抽象概念，缺少一个循序渐进的学习过程。
zh_hant: 很多人覺得程式設計難，並不一定是因為程式語言本身複雜，而是因為一開始就接觸了太多抽象概念，缺少一個循序漸進的學習過程。
